#include "MyGame.h"

//Windowsアプリでのエントリーポイント(main関数)
int WINAPI WinMain(HINSTANCE, HINSTANCE, LPSTR, int) {

    MyGame* game;

    // ゲームの初期化
    game->Initialize();

    // ウィンドウの×ボタンが押されるまでループ
    while (true) {
        // Windowのメッセージ処理
        if (winApp->ProcessMessage()) {
            // ゲームループを抜ける
            break;
        }
        // ゲームの処理

        // 入力の更新
        input->Update();

        // 0を押している間true
        if (input->Pushkey(DIK_0)) {
            OutputDebugStringA("Hit 0 \n");
        }


        if (input->Pushkey(DIK_SPACE) && soundfige == 0) {
            soundfige = 1;
        }

        if (soundfige == 1) {
            // 音声再生
            soundPlayer->SoundPlayWave(soundData, false);
            soundfige = 2;
        }

#pragma region  ImGuiの更新処理開始
        // ImGuiの受付開始
        imGuiManager->Begin();
        // デモウィンドウの表示
        //ImGui::ShowDemoWindow(); 

        // スプライト
        sprite->DebugUpdata();

#pragma endregion ImGuiの更新処理終了

        /*-------------------------------------------------------------------------------------------------------------------------------*/
        /*--------------------------------------------------------更新処理の開始-----------------------------------------------------------*/
        /*-------------------------------------------------------------------------------------------------------------------------------*/

        /*-------------------------------------------*/
        /*--------------カメラの更新処理---------------*/
        /*------------------------------------------*/
        camera->Update();

        camera->SetTranslate(Cameraposition);
        camera->SetRotate(Camerarotation);

        /*-------------------------------------------------------------------------------------------------------*/
        /*-----------------------------------3Dオブジェクトの更新処理の開始------------------------------------------*/
        /*------------------------------------------------------------------------------------------------------*/


        // 更新処理
       // object3d->Update();

        size_t index = 0;
        size_t maxIterations = 2;
        for (Object3d* object3d : objects) {
            if (index >= maxIterations) {
                break; // 指定回数を超えたらループを終了
            }
            object3d->Update();
            Vector3 rotation = object3d->GetRotate();
            if (index == 0) {
                rotation.z += 0.01f;
            } else if (index == 1) {
                rotation.y += 0.01f;
            }
            object3d->SetRotate(rotation);
            // インクリメントして次へ
            ++index;
        }

        /*-------------------------------------------------------------------------------------------------------*/
        /*-----------------------------------3Dオブジェクトの更新処理の終了------------------------------------------*/
        /*------------------------------------------------------------------------------------------------------*/


        /*----------------------------------------------------------------------------------------------------*/
        /*---------------------------------------Spriteの更新処理----------------------------------------------*/
        /*---------------------------------------------------------------------------------------------------*/


        // 更新処理
        sprite->Update();


        /*----------------------------------------------------------------------------------------------------*/
        /*-------------------------------------Spriteの更新処理終了----------------------------------------------*/
        /*---------------------------------------------------------------------------------------------------*/

        // ImGuiの描画前準備
        imGuiManager->End();

        /*-------------------------------------------------------------------------------------------------------------------------------*/
        /*--------------------------------------------------------更新処理の終了-----------------------------------------------------------*/
        /*-------------------------------------------------------------------------------------------------------------------------------*/

        //  描画用のDescriptorHeapの設定
        srvManager->PreDraw();
        //  DirectXの描画準備。全ての描画に共通のグラフィックスコマンドを積む
        dxCommon->PreDraw();
        // 3Dオブジェクトの描画準備。3Dオブジェクトの描画に共通のグラフィックスコマンドを積む
        object3dCommon->Commondrawing();
        // Spriteの描画準備。Spriteの描画に共通のグラフィックスコマンドを積む
        spriteCommon->Commondrawing();

        /*-------------------------------------------------------------------------------------------------------------------------------*/
        /*--------------------------------------------------------描画処理の開始-----------------------------------------------------------*/
        /*-------------------------------------------------------------------------------------------------------------------------------*/

        /*------------------------------------------------------------------------------------------------------*/
        /*----------------------------------3Dオブジェクトの描画処理開始--------------------------------------------*/
        /*-----------------------------------------------------------------------------------------------------*/

#pragma region 全てのObject3d個々の描画

       // object3d->Draw();

        for (Object3d* object3d : objects) {
            object3d->Draw();
        }

#pragma endregion 全てのObject3d個々の描画

        /*------------------------------------------------------------------------------------------------------*/
        /*----------------------------------3Dオブジェクトの描画処理終了--------------------------------------------*/
        /*-----------------------------------------------------------------------------------------------------*/


        /*----------------------------------------------------------------------------------------------------*/
        /*------------------------------------Spriteの描画処理開始----------------------------------------------*/
        /*---------------------------------------------------------------------------------------------------*/

#pragma region 全てのSprite個々の描画

        //// Spriteの描画は常にuvCheckerにする
        //dxCommon->GetCommandList()->SetGraphicsRootDescriptorTable(2, textureSrvHandleGPU);

        sprite->Draw();

#pragma endregion 全てのSprite個々の描画

        /*----------------------------------------------------------------------------------------------------*/
        /*------------------------------------Spriteの描画処理終了----------------------------------------------*/
        /*---------------------------------------------------------------------------------------------------*/

        /*-------------------------------------------------------------------------------------------------------------------------------*/
        /*--------------------------------------------------------描画処理の終了-----------------------------------------------------------*/
        /*-------------------------------------------------------------------------------------------------------------------------------*/

        // ImGuiの描画開始
        imGuiManager->Draw();
        // 描画後処理
        dxCommon->PostDrow();
    }

    // シーンの解放
    delete  spriteCommon;
    delete  object3dCommon;
    delete modelCommon;

    // 汎用機能の解放
    delete  sprite;

    //sprites.clear();

    for (Sprite* sprite : sprites) {
        delete sprite;
    }

    // 3Dモデルの解放
    delete model;

    // 3Dオブジェクトの解放
    delete  object3d;
    for (Object3d* object3d : objects) {
        delete object3d;
    }
    // 入力解放
    delete input;
    // テクスチャマネージャーの終了
    TextureManager::GetInstance()->Finalize();
    // 3Dモデルマネージャの終了
    ModelManager::GetInstance()->Finalize();
    // ImGuiマネージャの解放
    delete imGuiManager;
    // SRVマネージャの開放
    delete srvManager;
    // 音声データ解放
    delete soundLoader;
    // 音声再生
    soundPlayer->SoundUnload(&soundData);
    delete soundPlayer;
    // DirectXの解放
    delete dxCommon;
    // WindowsAPIの解放
    delete winApp;
    return 0;
}